openpinballproject/opp/Stm32Workbench/OppGen3/Src/Common/rs232proc.c
/*
 *===============================================================================
 *
 *                         OOOOOO
 *                       OOOOOOOOOO
 *      PPPPPPPPPPPPP   OOO      OOO   PPPPPPPPPPPPP
 *    PPPPPPPPPPPPPP   OOO        OOO   PPPPPPPPPPPPPP
 *   PPP         PPP   OOO        OOO   PPP         PPP
 *  PPP          PPP   OOO        OOO   PPP          PPP
 *  PPP          PPP   OOO        OOO   PPP          PPP
 *  PPP          PPP   OOO        OOO   PPP          PPP
 *   PPP         PPP   OOO        OOO   PPP         PPP
 *    PPPPPPPPPPPPPP   OOO        OOO   PPPPPPPPPPPPPP
 *     PPPPPPPPPPPPP   OOO        OOO   PPP
 *               PPP   OOO        OOO   PPP
 *               PPP   OOO        OOO   PPP
 *               PPP   OOO        OOO   PPP
 *               PPP    OOO      OOO    PPP
 *               PPP     OOOOOOOOOO     PPP
 *              PPPPP      OOOOOO      PPPPP
 *
 * @file:   rs232proc.c
 * @author: Hugh Spahr
 * @date:   12/06/2012
 *
 * @note:   Open Pinball Project
 *          Copyright� 2012-2015, Hugh Spahr
 *
 *  This program is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation, either version 3 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with this program.  If not, see <http://www.gnu.org/licenses/>.
 *
 *===============================================================================
 */
/**
 * This is the serial port processing for the Gen2 hardware.  It
 * uses the first serial port.
 *
 *===============================================================================
 */
 
#include "stdtypes.h"
#define RS232I_INSTANTIATE
#include "rs232intf.h"
#include "stdlintf.h"
#include "neointf.h"
#include "procdefs.h"         /* for EnableInterrupts macro */
#include "gen2glob.h"

#include "stm32f1xx_hal.h"

#define STDL_FILE_ID          2

#define TX_BUF_SIZE           0x10
#define RX_BUF_SIZE           0x400
#define MAX_RCV_CMD_LEN       0x34     /* Must include space for CRC8 */

typedef enum
{
   RS232_WAIT_FOR_CARD_ID     = 0x00,
   RS232_WAIT_FOR_CMD         = 0x01,
   RS232_STRIP_CMD            = 0x02,
   RS232_RCV_DATA_CMD         = 0x03,  /* Also strips the data */
   RS232_INVENTORY_CMD        = 0x04,  /* Special case since unknown length */
   RS232_NEO_COLOR_TBL        = 0x05,
   RS232_RCV_NEO_HDR          = 0x06,
   RS232_RCV_NEO_DATA         = 0x07,
} RS232_STATE_E;

typedef struct
{
   RS232_STATE_E              state;
   U8                         cmdLen;
   RS232I_CMD_E               currCmd;
   U8                         currIndex;
   U8                         crc8;
   U8                         *rcvHead_p;
   U8                         *rcvTail_p;
   U8                         rxBuf[RX_BUF_SIZE];
   U8                         rxTmpBuf[MAX_RCV_CMD_LEN];
} RS232_GLOB_T;

RS232_GLOB_T                  rs232_glob;

/* Prototypes */
void digital_set_solenoid_input(
   RS232I_SET_SOL_INP_E       inputIndex,
   U8                         solIndex);
void digital_set_kick_pwm(
   U8                         kickPwm,
   U8                         solIndex);
void digital_upd_sol_cfg(
   U32                        numSol);
void digital_upd_ind_sol_cfg(
   U32                        solNum);
void digital_upd_inp_cfg(
   U32                        numInp);
void digital_upd_ind_inp_cfg(
   U32                        inpNum);
void digital_set_inp_cfg(
   U32                        inpNum,
   RS232I_CFG_INP_TYPE_E      inpCfg);
void digital_convert_v0_sol_cfg_to_v1_solcfg(
   INT                        solIndex,
   RS232I_SOL_CFG_T           *cfg_p);

void rs232proc_rx_buffer(
   U8                          *rcv_p,
   U32                         length);
void rs232proc_bswap_copy_dest(
   U32                        *data_p,
   U8                         *dst_p);
void rs232proc_copy_dest(
   U8                         *src_p,
   U8                         *dst_p,
   UINT                       length);
void rs232proc_bswap_data_buf(
   U32                        *data_p,
   UINT                       numBytes);
void incand_proc_cmd(
   U8                         cmd,
   U32                        mask);
void stdlser_get_xmt_info(
   U8                         **data_pp,
   U16                        *numChar_p);
uint8_t CDC_Transmit_FS(uint8_t* Buf, uint16_t Len);
void fade_update_rcv_cmd(
   U16                  offset,
   U16                  numBytes,
   U16                  fadeTime);
BOOL fade_update_rcv_data(
   U8                   data);

/*
 * ===============================================================================
 * 
 * Name: rs232proc_init
 * 
 * ===============================================================================
 */
/**
 * Initialize RS232 processing
 * 
 * Initialize serial port link.
 * 
 * @param   None 
 * @return  None
 * 
 * @pre     None 
 * @note    None
 * 
 * ===============================================================================
 */
void rs232proc_init(void) 
{
   /* Initialize the global structure */
   rs232_glob.state = RS232_WAIT_FOR_CARD_ID;
   rs232_glob.rcvHead_p = &rs232_glob.rxBuf[0];
   rs232_glob.rcvTail_p = &rs232_glob.rxBuf[0];
} /* End rs232proc_init */

/*
 * ===============================================================================
 * 
 * Name: rs232proc_task
 * 
 * ===============================================================================
 */
/**
 * Task for rs232 commands
 * 
 * @param   None 
 * @return  None
 * 
 * @pre     None 
 * @note    Verifying the CRC is only necessary for changing configuration
 *    commands.  The CRC will be verified for other commands, but commands are
 *    not ignored if that CRC is bad because the command response is already
 *    being sent.
 * 
 * ===============================================================================
 */
void rs232proc_task(void)
{
   U8                         data;
   U8                         txBuf[RS232I_MAX_TX_BUF_SZ];
   U8                         *src_p;
   U8                         *dest_p;
   UINT                       index;
   U32                        mask;
   U32                        tmpU32;
   uint8_t                    *xmtData_p;
   uint16_t                   xmtLength;

#define INCAND_CMD_OFFSET     0
#define INCAND_MASK_OFFSET    1
#define CONFIG_NUM_OFFSET     0
#define CONFIG_DATA_OFFSET    1
  
