openpinballproject/opp/Stm32Workbench/OppGen3/Src/Common/rs232proc.c
/*
 * ===============================================================================
 * 
 * Name: rs232proc_rx_ser_char
 * 
 * ===============================================================================
 */
/**
 * Receive a buffer
 * 
 * Receive a data buffer from USB.  Save the buffer, length, and mark the flag.
 * 
 * @param   rcv_p - received buffer pointer
 * @param   length - amount of data received
 * @return  TRUE if buffer overflow occurs
 * 
 * @pre     None 
 * @note    None
 * 
 * ===============================================================================
 */
void rs232proc_rx_buffer(
   U8                          *rcv_p,
   U32                         length)
{
   U8                          *nxt_p;

   nxt_p = rs232_glob.rcvHead_p;
   while (length != 0)
   {
      /* Verify write won't overflow the queue */
      nxt_p++;
      if (nxt_p >= &rs232_glob.rxBuf[RX_BUF_SIZE])
      {
         nxt_p = &rs232_glob.rxBuf[0];
      }
      if (nxt_p != rs232_glob.rcvTail_p)
      {
         *rs232_glob.rcvHead_p = *rcv_p++;
         rs232_glob.rcvHead_p = nxt_p;
         length--;
      }
      else
      {
         break;
      }
   }
} /* End rs232proc_rx_buffer */

/*
 * ===============================================================================
 * 
 * Name: rs232proc_bswap_copy_dest
 * 
 * ===============================================================================
 */
/**
 * Byte swap 32 bit data and copy to destination
 * 
 * This converts from little endian to big endian for destination byte stream.
 * 
 * @param   None 
 * @return  None
 * 
 * @pre     None 
 * @note    None
 * 
 * ===============================================================================
 */
void rs232proc_bswap_copy_dest(
   U32                        *data_p,
   U8                         *dst_p)
{
   U32                        data;
   U8                         *src_p;
   UINT                       index;
   
   data = *data_p;
   data = ((data >> 24) & 0xff) | ((data << 8) & 0xff0000) |
      ((data >> 8) & 0xff00) | ((data << 24) & 0xff000000);
   for (src_p = (U8 *)&data, index = 0; index < sizeof(U32); index++)
   {
      *dst_p++ = *src_p++;
   }
} /* End rs232proc_bswap_copy_dest */

/*
 * ===============================================================================
 * 
 * Name: rs232proc_copy_dest
 * 
 * ===============================================================================
 */
/**
 * Byte copy to destination
 * 
 * @param   None 
 * @return  None
 * 
 * @pre     None 
 * @note    None
 * 
 * ===============================================================================
 */
void rs232proc_copy_dest(
   U8                         *src_p,
   U8                         *dst_p,
   UINT                       length)
{
   UINT                       index;
   
   for (index = 0; index < length; index++)
   {
      *dst_p++ = *src_p++;
   }
} /* End rs232proc_copy_dest */


/*
 * ===============================================================================
 * 
 * Name: rs232proc_bswap_data_buf
 * 
 * ===============================================================================
 */
/**
 * Byte swap received data buffer to move from little endian to big endian
 * 
 * This converts from received bytes stream from little endian to big endian.
 * 
 * @param   None 
 * @return  None
 * 
 * @pre     None 
 * @note    None
 * 
 * ===============================================================================
 */
void rs232proc_bswap_data_buf(
   U32                        *data_p,
   UINT                       numBytes)
{
   U32                        data;
   UINT                       index;
   
   for (index = 0; index < numBytes; index += sizeof(U32))
   {
      data = *data_p;
      *data_p++ = ((data >> 24) & 0xff) | ((data << 8) & 0xff0000) |
         ((data >> 8) & 0xff00) | ((data << 24) & 0xff000000);
   }
} /* End rs232proc_bswap_data_buf */

/* [] END OF FILE */
